-- insert into the archives table
INSERT INTO
  "archives" (id, code, title)
VALUES
  (
    gen_random_uuid(),
    'ЦДАВО',
    'Центральний державний архів вищих органів влади та управління України'
  ),
  (
    gen_random_uuid(),
    'ЦДАГО',
    'Центральний державний архів громадських об''єднань України'
  ),
  (
    gen_random_uuid(),
    'ЦДІАК',
    'Центральний державний історичний архів України м. Київ'
  ),
  (
    gen_random_uuid(),
    'ЦДІАЛ',
    'Центральний державний історичний архів України м. Львів'
  ),
  (
    gen_random_uuid(),
    'ЦДКФФА',
    'Центральний державний кінофотофоноархів України ім. Г. С. Пшеничного'
  ),
  (
    gen_random_uuid(),
    'ЦДНТА',
    'Центральний державний науково-технічний архів України'
  ),
  (
    gen_random_uuid(),
    'ЦДАМЛМ',
    'Центральний державний архів-музей літератури і мистецтва України'
  ),
  (
    gen_random_uuid(),
    'ЦДАЗУ',
    'Центральний державний архів зарубіжної україніки'
  ),
  (
    gen_random_uuid(),
    'ЦДЕА',
    'Центральний державний електронний архів України'
  ),
  (
    gen_random_uuid(),
    'ДАВіО',
    'Державний архів Вінницької області'
  ),
  (
    gen_random_uuid(),
    'ДАВоО',
    'Державний архів Волинської області'
  ),
  (
    gen_random_uuid(),
    'ДАДнО',
    'Державний архів Дніпропетровської області'
  ),
  (
    gen_random_uuid(),
    'ДАДоО',
    'Державний архів Донецької області'
  ),
  (
    gen_random_uuid(),
    'ДАЖО',
    'Державний архів Житомирської області'
  ),
  (
    gen_random_uuid(),
    'ДАЗкО',
    'Державний архів Закарпатської області'
  ),
  (
    gen_random_uuid(),
    'ДАЗпО',
    'Державний архів Запорізької області'
  ),
  (
    gen_random_uuid(),
    'ДАІФО',
    'Державний архів Івано-Франківської області'
  ),
  (
    gen_random_uuid(),
    'ДАКО',
    'Державний архів Київської області'
  ),
  (
    gen_random_uuid(),
    'ДАК',
    'Державний архів міста Києва'
  ),
  (
    gen_random_uuid(),
    'ДАКрО',
    'Державний архів Кіровоградської області'
  ),
  (
    gen_random_uuid(),
    'ДАЛуО',
    'Державний архів Луганської області'
  ),
  (
    gen_random_uuid(),
    'ДАЛО',
    'Державний архів Львівської області'
  ),
  (
    gen_random_uuid(),
    'ДАМО',
    'Державний архів Миколаївської області'
  ),
  (
    gen_random_uuid(),
    'ДАОО',
    'Державний архів Одеської області'
  ),
  (
    gen_random_uuid(),
    'ДАПО',
    'Державний архів Полтавської області'
  ),
  (
    gen_random_uuid(),
    'ДАРО',
    'Державний архів Рівненської області'
  ),
  (
    gen_random_uuid(),
    'ДАСО',
    'Державний архів Сумської області'
  ),
  (
    gen_random_uuid(),
    'ДАТО',
    'Державний архів Тернопільської області'
  ),
  (
    gen_random_uuid(),
    'ДАХО',
    'Державний архів Харківської області'
  ),
  (
    gen_random_uuid(),
    'ДАХеО',
    'Державний архів Херсонської області'
  ),
  (
    gen_random_uuid(),
    'ДАХмО',
    'Державний архів Хмельницької області'
  ),
  (
    gen_random_uuid(),
    'ДАЧкО',
    'Державний архів Черкаської області'
  ),
  (
    gen_random_uuid(),
    'ДАЧвО',
    'Державний архів Чернівецької області'
  ),
  (
    gen_random_uuid(),
    'ДАЧгО',
    'Державний архів Чернігівської області'
  ),
  (
    gen_random_uuid(),
    'ДАС',
    'Державний архів міста Севастополя'
  ),
  (
    gen_random_uuid(),
    'ДААРК',
    'Державний архів в Автономній Республіці Крим'
  ),
  (
    gen_random_uuid(),
    'ГДА МВС',
    'Галузевий державний архів Міністерства внутрішніх справ України'
  ),
  (
    gen_random_uuid(),
    'ГДА СБУ',
    'Галузевий державний архів Служби безпеки України'
  ),
  (
    gen_random_uuid(),
    'ГДА СЗРУ',
    'Галузевий державний архів Служби зовнішньої розвідки України'
  );